pkda5203/TM4C123GXL_DMX512_controller/prabeshKhadka.c
    //configure UART1 pins
    //set tx pin into normal gpio mode and drive zero
    GPIO_PORTC_DIR_R |= 0x60;                        //set the bit 5 and 6 as output and rest as input
    GPIO_PORTC_DEN_R |= 0x70;                        //set digital enable on bits 5 and 6 //drives zero by default
    SYSCTL_RCGCUART_R |= SYSCTL_RCGCUART_R1;         // turn-on UART1, leave other UARTs in same status
    GPIO_PORTC_PCTL_R |= GPIO_PCTL_PC5_U1TX | GPIO_PCTL_PC4_U1RX;
    SYSCTL_RCGCTIMER_R |= SYSCTL_RCGCTIMER_R1 | SYSCTL_RCGCTIMER_R0;       // turn-on timer
    
}

void setServo(uint16_t input)
{
    PWM0_1_CMPB_R = input;
    
}

//intialize hardware for the UART1 RX/ DMX512 receive data
void initUart1RX()
{
    rxPhase=0;
    PIN_DEN=0;
    GPIO_PORTC_AFSEL_R |= 0x10;                       //turn on UART on the pin
    // Configure UART1 to 250000 baud, 8N2 format (must be 3 clocks from clock enable and config writes)
    UART1_CTL_R = 0;                                  // turn-off UART0 to allow safe programming
    // delay4Cycles();
    UART1_CC_R = UART_CC_CS_SYSCLK;                  // use system clock (40 MHz)
    UART1_IBRD_R = 10;                               // r = 40 MHz / (Nx250kHz), set floor(r)=21, where N=16
    UART1_FBRD_R = 0;                               // round(fract(r)*64)=45
    UART1_LCRH_R = UART_LCRH_WLEN_8 | UART_LCRH_FEN |UART_LCRH_STP2 ; // configure for 8N1 w/o FIFO
    UART1_CTL_R = UART_CTL_RXE | UART_CTL_UARTEN;//| UART_CTL_EOT; // enable TX, RX, and module and end of transmission
    UART1_IM_R = UART_IM_RXIM;
    NVIC_EN0_R |= 1 << (INT_UART1-16);               // turn-on interrupt 22 (UART0)
    timeout1=40;
    
    //UART1_IM_R = UART_RIS_TXRIS;                     //enable the UART1 interrupt
    
    
}

void initEEPROM()
{
    SYSCTL_RCGCEEPROM_R |=SYSCTL_RCGCEEPROM_R0;
    // EEPROM_EEDBGME_R|=(0xE37B<<16)|EEPROM_EEDBGME_ME;
    delay4Cycles(); //add 6 delay cycle plus the function overhead
    delay4Cycles();
    while(EEPROM_EEDONE_R & EEPROM_EEDONE_WORKING);  //poll the EEDONE register, continue when working=0;
    if ((EEPROM_EESUPP_R & EEPROM_EESUPP_PRETRY)||(EEPROM_EESUPP_R & EEPROM_EESUPP_ERETRY))
    {
        initEEPROM();       //error if the PRETRY and ERETRY bits are set
    }
    //    else
    //    {
    //        //do nothing
    //    }
    SYSCTL_SREEPROM_R|=SYSCTL_SREEPROM_R0;      //EEROM software reset
    SYSCTL_SREEPROM_R&=0;
    
    delay4Cycles();
    delay4Cycles();
    
    while(EEPROM_EEDONE_R & EEPROM_EEDONE_WORKING);  //poll the EEDONE register, continue when working=0;
    //  //  if (EEPROM_EESUPP_R==EEPROM_EESUPP_PRETRY||EEPROM_EESUPP_R==EEPROM_EESUPP_ERETRY)
    //    {
    //        initEEPROM();       //error if the PRETRY and ERETRY bits are set
    //    }
    //    else
    //    {
    //        continue;
    //    }
}

void initTimer1()
{
    PIN_DEN=1;                                       //set PC6 (Data enable pin to high)
    UART1_CTL_R = 0;                                //turn off UART1
    GPIO_PORTC_AFSEL_R = 0;                         //clear the AFSEL register on port c for normal GPIO mode
    GPIO_PORTC_DATA_R &=0xDF;                        //drive zero on the Tx pin
    //Configure Timer 1 for the timer1 interrupt
    //send break
    TIMER1_CTL_R &= ~TIMER_CTL_TAEN;                // turn-off timer before reconfiguring
    TIMER1_CFG_R = TIMER_CFG_32_BIT_TIMER;           // configure as 32-bit timer (A+B)
    TIMER1_TAMR_R = TIMER_TAMR_TAMR_PERIOD;          // configure for periodic mode (count down)
    TIMER1_TAILR_R = 0x1B80;                           // set load value to 1B80 for interrupt every 176 us
    
    TIMER1_IMR_R = TIMER_IMR_TATOIM;                 // turn-on interrupts
    NVIC_EN0_R |= 1 << (INT_TIMER1A-16);             // turn-on interrupt 37 (TIMER1A)
    TIMER1_CTL_R |= TIMER_CTL_TAEN;                  // turn-on timer
    phase = 0;
    
}

void initTimer0()
{
    TIMER0_CTL_R &= ~TIMER_CTL_TAEN;                // turn-off timer before reconfiguring
    TIMER0_CFG_R = TIMER_CFG_32_BIT_TIMER;           // configure as 32-bit timer (A+B)
    TIMER0_TAMR_R = TIMER_TAMR_TAMR_PERIOD;          // configure for periodic mode (count down)
    TIMER0_TAILR_R = 0x1E8480;                       // set load value to 1B80 for interrupt every 176 us
    
    TIMER0_IMR_R = TIMER_IMR_TATOIM;                 // turn-on interrupts
    NVIC_EN0_R |= 1 << (INT_TIMER0A-16);             // turn-on interrupt 37 (TIMER1A)
    TIMER0_CTL_R |= TIMER_CTL_TAEN;                  // turn-on timer
    
    
}
void initTimer3()
{
    TIMER3_CTL_R &= ~TIMER_CTL_TAEN;                // turn-off timer before reconfiguring
    TIMER3_CFG_R = TIMER_CFG_32_BIT_TIMER;           // configure as 32-bit timer (A+B)
    TIMER3_TAMR_R = TIMER_TAMR_TAMR_PERIOD;          // configure for periodic mode (count down)
    TIMER3_TAILR_R = 0x1E8480;                       // set load value to 1B80 for interrupt every 176 us
    
    TIMER0_IMR_R = TIMER_IMR_TATOIM;                 // turn-on interrupts
    NVIC_EN0_R |= 1 << (INT_TIMER0A-16);             // turn-on interrupt 37 (TIMER1A)
    TIMER0_CTL_R |= TIMER_CTL_TAEN;                  // turn-on timer
    
    
}

//code adopted from Dr. losh's provided example
// Blocking function that writes a serial character when the UART buffer is not full
void putcUart0(char c)
{
    while (UART0_FR_R & UART_FR_TXFF);               // wait if uart0 tx fifo full
    UART0_DR_R = c;                                  // write character to fifo
}

//code adopted from Dr. losh's provided example
// Blocking function that writes a string when the UART buffer is not full
void putsUart0(char* str)
{
    uint8_t i;
    for (i = 0; i < strlen(str); i++)
        putcUart0(str[i]);
}

//code adopted from Dr. losh's provided example
// Blocking function that returns with serial data once the buffer is not empty
char getcUart0()
{
    while (UART0_FR_R & UART_FR_RXFE);               // wait if uart0 rx fifo empty
    return UART0_DR_R & 0xFF;                        // get character from fifo
}

//code adopted from Dr. losh's provided example
void waitMicrosecond(uint32_t us)
{
    __asm("WMS_LOOP0:   MOV  R1, #6");          // 1
    __asm("WMS_LOOP1:   SUB  R1, #1");          // 6
    __asm("             CBZ  R1, WMS_DONE1");   // 5+1*3
    __asm("             NOP");                  // 5
    __asm("             NOP");                  // 5
    __asm("             B    WMS_LOOP1");       // 5*2 (speculative, so P=1)
    __asm("WMS_DONE1:   SUB  R0, #1");          // 1
    __asm("             CBZ  R0, WMS_DONE0");   // 1
    __asm("             NOP");                  // 1
    __asm("             B    WMS_LOOP0");       // 1*2 (speculative, so P=1)
    __asm("WMS_DONE0:");                        // ---
    // 40 clocks/us + error
}


//Step1: Flash LED to show that the code is up and running proper
void flashRedLed(uint16_t x)
{
    RED_LED=1;      //turn ON red led
    waitMicrosecond(x);
    RED_LED=0;
}

//Step 1: Flash LED to show that the code is up and running
void flashGreenLed(uint16_t x)
{
    GREEN_LED=1;      //turn ON green led
    waitMicrosecond(x);
    GREEN_LED=0;
}

