pkda5203/TM4C123GXL_DMX512_controller/prabeshKhadka.c
//step 2: get the string from the UART0
void getsUart0(char *str)
{
    int counter=0;
    char uartChar;
    uint16_t len = MAX_CHAR;
    uartChar = getcUart0();
    while(uartChar!= 13 && counter < len)   //is it c/r or the MAX_CHAR?
    {
        if(uartChar == 8)         //is it backspace?
        {
            if(counter)         //if counter is not zero
            {
                str--;
                counter--;
            }
        }
        else if(uartChar >= 32)     //is the char printable??
        {
            *str = tolower(uartChar);   //save the char to string as upper case
            str++;
            counter++;
        }
        uartChar = getcUart0();
    }
    *str = 0;       //add the null terminator
}


//the parse routine that goes through the string and
uint8_t parseCommand(char str1[], uint8_t pos[], char type[])
{
    uint8_t i;
    uint8_t d=1;
    uint8_t fCount;
    uint8_t j;
    uint8_t length =strlen(str1);
    for (i=0; i<length; i++)
    {
        if (str1[i]>96 && str1[i]<123)      //if the character of the string is a alpha a-z
        {
            if(d==1)
            {
                pos[j]=i;
                type[j]='a';
                fCount++;
                j++;
                d=0;
                // putsUart0("d->a\n");
            }
            else
            {
                d=0;
            }
            
        }
        else if (str1[i]>47 && str1[i]<58)     //if the character of the string is a number 0-9
        {
            if(d==1)
            {
                pos[j]=i;      //add the current index to the pos[]
                type[j]='n';
                fCount++;
                j++;
                d=0;
                // putsUart0("d->n\n");
            }
            else
            {
                d=0;
            }
        }
        else    //if the character of the string is a delimiter
        {
            
            d=1;
            str1[i]=0;  //replace all delimiters with null
        }
    }
    type[j]=0;   //end the type[] with null
    return fCount;
    
}
//
bool isCommand(char str[], uint8_t pos[], char *cmd)
{
    return ((strcmp(&str[pos[0]],cmd))==0);
}

uint16_t getValue (char str[], uint8_t pos[], uint8_t argNum)
{
    uint16_t value = atoi(&str[*(pos+1+argNum)]);
    return value;
}

char getString (char str[], uint8_t pos[], uint8_t argNum)
{
    return (&str[*(pos+1+argNum)]);
}

void toString(char str[], uint16_t num)
{
    uint16_t i, rem, len = 0, n;
    
    n = num;
    if (num==0)
    {
        str[len]=0+'0';
        len++;
        
    }
    while (n != 0)
    {
        len++;
        n /= 10;
    }
    for (i = 0; i < len; i++)
    {
        rem = num % 10;
        num = num / 10;
        str[len - (i + 1)] = rem + '0';
    }
    str[len] = 0;
}

void clearDmxData()
{
    ZERO_ANY_A(uint8_t, dmxData);
}



void timer0Isr()
{
    if (timeout==0)
    {
        GREEN_LED=0;
    }
    else
    {
        timeout--;
    }
    if (MODE==1)
    {
        if (timeout1==0)
        {
            GREEN_LED^=1;
            timeout1=20;
            
        }
        else
        {
            timeout1--;
        }
    }
    TIMER0_ICR_R = TIMER_ICR_TATOCINT;                  //clear timer interrupt
}

void timer1Isr()
{
    if (phase==0)               //when 176us has elapsed
    {
        //send MAB
        GPIO_PORTC_DATA_R |=0x20;                        //drive 1 on the Tx pin
        TIMER1_CTL_R &= ~TIMER_CTL_TAEN;                 // turn-off timer before reconfiguring
        TIMER1_TAILR_R = 0x01E0;                         // set load value to 1EO for interrupt every 12 us
        TIMER1_CTL_R |= TIMER_CTL_TAEN;
        TIMER1_ICR_R = TIMER_ICR_TATOCINT;              //clear interrupt
        phase = 1;
    }
    else if (phase==1)
    {
        phase=2;
        GPIO_PORTC_AFSEL_R |= 0x30;                       //turn on UART on the pin
        // Configure UART1 to 250000 baud, 8N2 format (must be 3 clocks from clock enable and config writes)
        UART1_CTL_R = 0;                                  // turn-off UART0 to allow safe programming
        // delay4Cycles();
        UART1_CC_R = UART_CC_CS_SYSCLK;                  // use system clock (40 MHz)
        UART1_IBRD_R = 10;                               // r = 40 MHz / (Nx250kHz), set floor(r)=21, where N=16
        UART1_FBRD_R = 0;                               // round(fract(r)*64)=45
        UART1_LCRH_R = UART_LCRH_WLEN_8 | UART_LCRH_FEN |UART_LCRH_STP2 ; // configure for 8N1 w/o FIFO
        UART1_CTL_R = UART_CTL_TXE | UART_CTL_UARTEN| UART_CTL_EOT; // enable TX, RX, and module and end of transmission
        NVIC_EN0_R |= 1 << (INT_UART1-16);               // turn-on interrupt 22 (UART1)
        
        TIMER1_CTL_R &= ~TIMER_CTL_TAEN;                 // turn-off timer
        //    UART1_IM_R = UART_RIS_TXRIS;                     //enable the UART1 interrupt
        UART1_IM_R = UART_IM_TXIM;
        while (UART1_FR_R & UART_FR_TXFF);
        UART1_DR_R = 0;
        
    }
    TIMER1_ICR_R = TIMER_ICR_TATOCINT;                  //clear timer interrupt
}

//UART interrupt handler
void processCommand()
{
    if (SERVO==1)
    {
        uint16_t position = rxData[19]*25;
        position = 6020 - position;
        setServo(position);
        
    }
    if (rxData[deviceAddress-1]>0)
    {
        BLUE_LED=1;
    }
    else if (rxData[deviceAddress-1]==0)
    {
        BLUE_LED=0;
    }
    
}


void uart1Isr()
{
    if (UART1_MIS_R==UART_MIS_TXMIS)  //if the interrupt was triggered by UART TX
    {
        if ((phase-2)<maxM)                                 //transmit all 512 data
        {
            UART1_DR_R = dmxData[phase-2];
            phase++;
            UART1_ICR_R = UART_ICR_TXIC;                    //clear the uart interrupt
        }
        else
        {
            UART1_CTL_R =0;
            
            while (UART1_FR_R & UART_FR_BUSY);
            if (ON==1)
            {
                initTimer1();
            }
            UART1_ICR_R = UART_ICR_TXIC;
        }
    }
    else    //if the interrupt was triggered by UART RX
    {
        if (GREEN_LED==0)
        {
            GREEN_LED=1;
        }
        tempData=UART1_DR_R;
        if((tempData & UART_DR_BE)==UART_DR_BE)
        {
            
            rxPhase=1;
            processCommand();
            timeout1=40;
            // GREEN_LED=1;
        }
        switch(rxPhase)
        {
            case 0: break;
                
            case 1:
                if((tempData & 0xFF)==0)
                {
                    rxPhase=2;
                    break;
                }
                
