pkda5203/TM4C123GXL_DMX512_controller/prabeshKhadka.c
            case 2:
                rxData[rxPhase-2]=(tempData & 0xFF);
                rxPhase++;
                break;
            default:
                rxData[rxPhase-3]=(tempData & 0xFF);
                rxPhase++;
                break;
                //rxPhase++;
                
        }
        
    }
    UART1_ICR_R = UART_ICR_RXIC;
}
//-----------------------------------------------------------------------------
// Main
//-----------------------------------------------------------------------------

int main(void)
{
    // Initialize hardware
    initHw();
    initEEPROM();
    initTimer0();
    // EEPROMinit();
    clearDmxData();     //intialize the dmx data table to zero
    // initTimer1();       //intialize the timer settings
    // Display greeting
    char uartString[MAX_CHAR+1];
    putsUart0("\n-----------------------------------------------------------\n");
    putsUart0("             CSE4342 Embedded Systems II\n                 Spring 2019 Project\n");
    putsUart0("------------------------------------------------------------\n");
    putsUart0("Name  : Prabesh Khadka\nUTA ID: 1001201007\n");
    putsUart0("------------------------------------------------------------\n");
    putsUart0("Welcome to my project!!!\n\n");
    
    
    //step1
    
    RED_LED=1;
    waitMicrosecond(500000);
    RED_LED=0;
    waitMicrosecond(500000);
    //end of step1
    
    
    EEPROM_EEBLOCK_R &=0xFFFFFFFE;
    EEPROM_EEOFFSET_R &=0xFFFFFFFE;
    EEPROM_EEBLOCK_R|=0x0;
    EEPROM_EEOFFSET_R|=0x0;
    
    if (EEPROM_EERDWR_R==1)
    {
        putsUart0("Device");
        MODE=1;
    }
    EEPROM_EEBLOCK_R&=0xFFFFFFFE;
    EEPROM_EEOFFSET_R&=0xFFFFFFFE;
    EEPROM_EEBLOCK_R|=0x0;
    EEPROM_EEOFFSET_R|=0x0;
    if (EEPROM_EERDWR_R==0)
    {
        putsUart0("controller");
        MODE=0;
    }
    EEPROM_EEBLOCK_R&=0xFFFFFFFE;
    EEPROM_EEOFFSET_R&=0xFFFFFFFE;
    EEPROM_EEBLOCK_R|=0x0;
    EEPROM_EEOFFSET_R|=0x1;
    deviceAddress=EEPROM_EERDWR_R;
    if (deviceAddress==32)
    {
        putsUart0("Hurray");
    }
    
    if (MODE==1)
    {
        initUart1RX();
        
    }
    
    while(1)
    {
        uint8_t i;
        uint16_t address;
        uint16_t data;
        char type[MAX_CHAR+1];
        char uartString[MAX_CHAR+1];
        char buffer[20];
        bool OK;
        
        //step2
        putsUart0("$ ");
        getsUart0(uartString);
        GREEN_LED=1;
        timeout=1;
        putsUart0(uartString);      //display to the screen for debug
        putsUart0("\n");
        //end of step 2
        
        //step 3
        fieldCount=parseCommand(uartString,pos,type);
        
        //end of step 3
        OK = false;
        
        
        
        if (MODE==0)
        {
            
            //step 4
            if(isCommand(uartString, pos, "clear") && (fieldCount>0))        //clear command
            {
                putsUart0("The command that you entered was CLEAR");
                putsUart0("\n");
                clearDmxData();
                OK=true;
            }
            
            
            if(isCommand(uartString, pos, "set") && (fieldCount>2))          //set command
            {
                putsUart0("The command that you entered was SET");
                putsUart0("\n");
                address= getValue(uartString, pos, 0);
                data= getValue(uartString, pos, 1);
                if (!(address>=1 && address<=512))
                {
                    putsUart0("Invalid Address; 1-512 required!");
                    putsUart0("\n");
                }
                else if (!(data>=0 && data<=255))
                {
                    putsUart0("Invalid data; 0-255 required!");
                    putsUart0("\n");
                }
                else
                {
                    dmxData[address-1]=data;
                    OK=true;
                }
                
            }
            
            if(isCommand(uartString, pos, "get") && (fieldCount==2))      //get
            {
                putsUart0("The command that you entered was GET");
                putsUart0("\n");
                address= getValue(uartString, pos, 0);
                if (!(address>=1 && address<=512))
                {
                    putsUart0("Invalid 1-512 required!");
                    putsUart0("\n");
                }
                else
                {
                    toString(buffer,dmxData[address-1]);
                    putsUart0(buffer);
                    putsUart0("\n");
                    OK=true;
                }
            }
            
            if(isCommand(uartString, pos, "on") && (fieldCount==1))       //on cammand
            {
                putsUart0("The command that you entered was ON");
                putsUart0("\n");
                ON =1;
                OK=true;
                RED_LED=1;
                initTimer1();
            }
            
            if(isCommand(uartString, pos, "off") && (fieldCount==1))      //off command
            {
                putsUart0("The command that you entered was OFF");
                putsUart0("\n");
                ON =0;
                RED_LED=0;
                OK=true;
            }
            
            if(isCommand(uartString, pos, "max") && (fieldCount>0))      //max command
            {
                putsUart0("The command that you entered was MAX");
                putsUart0("\n");
                address= getValue(uartString, pos, 0);
                if (!(address>=0 && address<=512))
                {
                    putsUart0("Invalid 0-512 required!");
                    putsUart0("\n");
                }
                else
                {
                    OK=true;
                    maxM=address;
                }
                
            }
            if(isCommand(uartString, pos, "servo") && (fieldCount==2))      //max command
            {
                putsUart0("The command that you entered was MAX");
                putsUart0("\n");
                address= getValue(uartString, pos, 0);
                if (!(address>=0 && address<=512))
                {
                    putsUart0("Invalid 0-512 required!");
                    putsUart0("\n");
                }
                else
                {
                    SERVO=1;
                    rxData[19]=address;
                    processCommand();
                    
                    OK=true;
                    
