pkda5203/TM4C123GXL_DMX512_controller/prabeshKhadka.c
                }
                
            }
            if(isCommand(uartString, pos, "device") && (fieldCount==1))      //controller command
            {
                putsUart0("The command that you entered was DEVICE");
                putsUart0("\n");
                ON =0;
                RED_LED=0;
                MODE=1;
                EEPROM_EEBLOCK_R&=0xFFFFFFFE;
                EEPROM_EEOFFSET_R&=0xFFFFFFFE;
                EEPROM_EEBLOCK_R|=0x0;
                EEPROM_EEOFFSET_R|=0x0;
                EEPROM_EERDWR_R=1;
                initUart1RX();
                OK=true;
                
            }
        }
        else if(MODE==1)
        {
            if(isCommand(uartString, pos, "controller") && (fieldCount==1))      //controller command
            {
                putsUart0("The command that you entered was CONTROLLER");
                putsUart0("\n");
                MODE=0;
                EEPROM_EEBLOCK_R&=0xFFFFFFFE;
                EEPROM_EEOFFSET_R&=0xFFFFFFFE;
                EEPROM_EEBLOCK_R|=0x0;
                EEPROM_EEOFFSET_R|=0x0;
                EEPROM_EERDWR_R=0;
                OK=true;
            }
            if(isCommand(uartString, pos, "address") && (fieldCount==2))      //max command
            {
                putsUart0("The command that you entered was ADDRESS");
                putsUart0("\n");
                address= getValue(uartString, pos, 0);
                if (!(address>=0 && address<=512))
                {
                    putsUart0("Invalid 0-512 required!");
                    putsUart0("\n");
                }
                else
                {
                    deviceAddress=address;
                    EEPROM_EEBLOCK_R&=0xFFFFFFFE;
                    EEPROM_EEOFFSET_R&=0xFFFFFFFE;
                    EEPROM_EEBLOCK_R|=0x0;
                    EEPROM_EEOFFSET_R|=0x1;
                    EEPROM_EERDWR_R=address;
                    OK=true;
                }
                
            }
        }
        if(!OK)      //if the command wasn't processed or was unidentified
        {
            putsUart0("Error");
            putsUart0("\n");
            
        }
        else      //if the command was processed
        {
            putsUart0("Ready");
            putsUart0("\n");
        }
        
        
    }
    
}

